emacs-help.org
#+TITLE: 簡単なEmacs 使用法
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/org.css">
#+OPTIONS: _:{}
#+OPTIONS: ^:{}
# * 簡単なEmacs 使用法
** はじめに
*** 起動と終了

    カレントディレクトリ "." をパラメタに指定して起動する場合

    #+begin_quote
    $ emacs .
    #+end_quote

    #+begin_example
     /home/user:
     used 352 available 53380644
     drwxr-xr-x   22 user   users        4096 Mar  4 18:06 .
     drwxrwsr-x    5 root   staff        4096 Feb 26 14:21 ..
     drwxr-xr-x    3 user   users        4096 Feb 26 11:37 .emacs.d
    -EEE:%%-F1  ~             6:27午後   (Dired by name)--L5--C58--Top-----
    #+end_example
    C-x C-c　　　　　Control を押したまま x c  で終了する

*** キー表記方法
    | 表記 | 押し方      |                       |
    |------+-------------+-----------------------|
    | C-x  | Control + x |                       |
    | M-x  | Escape x    |                       |
    | M-x  | Alt + x     | (IME表示が 'A')       |
    | M-x  | option + x  | (IME表示が 'A') (Mac) |
    | S-x  | Shift + x   |                       |
    | s-x  | command + x | (Mac)                 |
    | /    | <           | <                     |
    M- は「メタ」キーで Alt または option と同時押しか、Escape で代用する。\\
    s- は 「スーパー」キーで Mac OSX では command キーに割り当てられている。\\
\\
    例
    | コマンド  | 押し方                        | 機能                 |
    |-----------+-------------------------------+----------------------|
    | C-g       | Control + g                   | 動作のキャンセル     |
    | C-x d     | Control + x  (放して) d       | dired ファイラー表示 |
    | C-x C-b   | Controlを押したまま x b       | バッファリスト表示   |
    | s-a       | command + a                   | 全選択    (Mac)      |
    | M-x shell | Alt + x (Altを放して) "shell" | 内部shell 起動       |
    | /         | <                             | <                    |


