emacs-help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 14:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>簡単なEmacs 使用法</title>
<meta name="author" content="Akira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./css/org.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">簡単なEmacs 使用法</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8467ad8">1. はじめに</a>
<ul>
<li><a href="#org08ad6e1">1.1. 起動と終了</a></li>
<li><a href="#orga513df3">1.2. キー表記方法</a></li>
</ul>
</li>
<li><a href="#org20ff00c">2. dired ファイラー表示</a></li>
<li><a href="#orga0ce255">3. ファイルを開く/閉じる</a></li>
<li><a href="#org406c68d">4. カーソル移動</a>
<ul>
<li><a href="#orgbbda50a">4.1. Windows流</a></li>
<li><a href="#orgec99002">4.2. Mac流</a></li>
<li><a href="#org11ade73">4.3. emacs流</a></li>
</ul>
</li>
<li><a href="#orgf0af896">5. 検索</a></li>
<li><a href="#orgaa9c429">6. 編集</a></li>
<li><a href="#orgcdb9299">7. 選択</a>
<ul>
<li><a href="#org81ed0b4">7.1. ターミナルの機能</a></li>
<li><a href="#org1add76c">7.2. Shiftキーをつかった選択</a></li>
<li><a href="#org7d6a37f">7.3. Emacsの機能</a></li>
<li><a href="#org08f0a3b">7.4. コピー&amp;ペースト</a></li>
</ul>
</li>
<li><a href="#orgc5c0865">8. View モード (read only)</a></li>
<li><a href="#orgb816540">9. 再表示</a></li>
<li><a href="#orgb18c3c4">10. マルチ画面</a>
<ul>
<li><a href="#org686c781">10.1. 画面分割</a></li>
<li><a href="#org6a381f2">10.2. 次画面の操作</a></li>
<li><a href="#org330ccca">10.3. フレーム</a></li>
</ul>
</li>
<li><a href="#org9620932">11. 文字コードの指定</a>
<ul>
<li><a href="#orgb0ca706">11.1. コマンド実行の前に指定</a></li>
<li><a href="#org7c4a93b">11.2. 読み込んだファイルの変更</a></li>
<li><a href="#org68c5056">11.3. 文字コード表示</a></li>
</ul>
</li>
<li><a href="#org2c65203">12. 文字サイズの変更</a></li>
<li><a href="#org6d07dc6">13. いろいろなコマンド</a>
<ul>
<li><a href="#orgaa20f39">13.1. コマンドに与える引数</a></li>
<li><a href="#orgc50db57">13.2. 内部シェルの起動</a></li>
</ul>
</li>
<li><a href="#orgdff1780">14. 終了、中断</a></li>
<li><a href="#org5a1ba29">15. function key 設定一覧</a></li>
<li><a href="#orgd366bca">16. help</a>
<ul>
<li><a href="#org85d56e4">16.1. ヘルプ画面集</a>
<ul>
<li><a href="#org3970f52">16.1.1. メニュー</a></li>
<li><a href="#org49f75f7">16.1.2. tutorial</a></li>
<li><a href="#orgc73fe6e">16.1.3. info</a></li>
<li><a href="#orgb28c5df">16.1.4. 初期画面</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8e70e0e">17. コンソール起動する時の設定</a>
<ul>
<li><a href="#orgcb00210">17.1. iTerm2 設定 (Mac OSX)</a></li>
<li><a href="#org0a5f77a">17.2. teraterm 設定 (Windows)</a></li>
<li><a href="#orgbfb298d">17.3. 左Cntl キーの位置について</a></li>
</ul>
</li>
<li><a href="#orga2fac34">18. 方針</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8467ad8" class="outline-2">
<h2 id="org8467ad8"><span class="section-number-2">1.</span> はじめに</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org08ad6e1" class="outline-3">
<h3 id="org08ad6e1"><span class="section-number-3">1.1.</span> 起動と終了</h3>
<div class="outline-text-3" id="text-1-1">
<p>
カレントディレクトリ "." をパラメタに指定して起動する場合
</p>

<blockquote>
<p>
$ emacs .
</p>
</blockquote>

<pre class="example" id="org0abd5fb">
 /home/user:
 used 352 available 53380644
 drwxr-xr-x   22 user   users        4096 Mar  4 18:06 .
 drwxrwsr-x    5 root   staff        4096 Feb 26 14:21 ..
 drwxr-xr-x    3 user   users        4096 Feb 26 11:37 .emacs.d
-EEE:%%-F1  ~             6:27午後   (Dired by name)--L5--C58--Top-----
</pre>
<p>
C-x C-c　　　　　Control を押したまま x c  で終了する
</p>
</div>
</div>

<div id="outline-container-orga513df3" class="outline-3">
<h3 id="orga513df3"><span class="section-number-3">1.2.</span> キー表記方法</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">表記</th>
<th scope="col" class="org-left">押し方</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x</td>
<td class="org-left">Control + x</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">M-x</td>
<td class="org-left">Escape x</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">M-x</td>
<td class="org-left">Alt + x</td>
<td class="org-left">(IME表示が 'A')</td>
</tr>

<tr>
<td class="org-left">M-x</td>
<td class="org-left">option + x</td>
<td class="org-left">(IME表示が 'A') (Mac)</td>
</tr>

<tr>
<td class="org-left">S-x</td>
<td class="org-left">Shift + x</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">s-x</td>
<td class="org-left">command + x</td>
<td class="org-left">(Mac)</td>
</tr>
</tbody>
</table>
<p>
    M- は「メタ」キーで Alt または option と同時押しか、Escape で代用する。<br />
    s- は 「スーパー」キーで Mac OSX では command キーに割り当てられている。<br />
<br />
    例
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">コマンド</th>
<th scope="col" class="org-left">押し方</th>
<th scope="col" class="org-left">機能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-g</td>
<td class="org-left">Control + g</td>
<td class="org-left">動作のキャンセル</td>
</tr>

<tr>
<td class="org-left">C-x d</td>
<td class="org-left">Control + x  (放して) d</td>
<td class="org-left">dired ファイラー表示</td>
</tr>

<tr>
<td class="org-left">C-x C-b</td>
<td class="org-left">Controlを押したまま x b</td>
<td class="org-left">バッファリスト表示</td>
</tr>

<tr>
<td class="org-left">s-a</td>
<td class="org-left">command + a</td>
<td class="org-left">全選択    (Mac)</td>
</tr>

<tr>
<td class="org-left">M-x shell</td>
<td class="org-left">Alt + x (Altを放して) "shell"</td>
<td class="org-left">内部shell 起動</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
