emacs-help.org
** dired ファイラー表示

    | 標準  | 代替キー |     |                                     |
    |-------+----------+-----+-------------------------------------|
    | C-x d | S-f5     | s-D | ディレクトリリスト表示              |
    | g     | f5       | s-u | ディレクトリ表示更新                |
    | p     | up       | k   | 前の行                              |
    | n     | down     | j   | 次の行                              |
    |       | C-up     | K   | １行上スクロール                    |
    |       | C-down   | J   | １行下スクロール                    |
    | <     | P        |     | 前のdirectory行                     |
    | >     | N        |     | 次のdirectory行                     |
    |       | home     | ,   | 先頭行へ                            |
    |       | end      | .   | 最終行へ                            |
    | f     | right    |     | directory降下 または ファイルを開く |
    | ^     | left     | C-b | directory上昇                       |
    | v     |          |     | View モード (read only) で開く      |
    |       | H        |     | ヘキサモードでファイルを表示        |
    | +     |          |     | ディレクトリ作成                    |
    | s     |          |     | 日付順ソート toggle                 |
    |       | E        |     | ファイル名直接編集 (C-c C-c で終了) |
    |       | a        |     | A_DIRECTORY へ移動 (.dirrc で定義)  |
    |       | b        |     | B_DIRECTORY へ移動                  |
    |       | c        |     | C_DIRECTORY へ移動                  |
    |       | e        |     | E_DIRECTORY へ移動                  |
    |       | h        |     | ホームディレクトリ ~ へ移動         |
    |       | r        |     | ルートディレクトリ / へ移動         |
    |       | z        |     | emacs 起動ディレクトリへ移動        |
    | /     | <        |     |                                     |
\\
    単独ファイルに対して (大文字)
    | 標準 | 代替キー |                             |
    |------+----------+-----------------------------|
    | D    |          | ファイル削除                |
    | C    |          | ファイルcopy                |
    | R    |          | リネーム、移動              |
    | S    |          | シンボリックリンク 作成     |
    | Y    |          | 相対シンボリックリンク 作成 |
    | M    |          | chmod                       |
    | W    | ! open   | OS標準のアプリで開く(Mac)   |
    | /    | <        |                             |
\\
    マークをつけて、複数ファイルに対して実行
    | 標準   | 　　 |                                                      |
    |--------+------+------------------------------------------------------|
    | d d..x |      | 削除選択し実行                                       |
    | ~ x    |      | (チルダx) ~付きバックアップファイルを全て選択し削除  |
    | m      |      | マーク * をつける                                    |
    | m m..D |      | 複数選択し削除                                       |
    | m m..C |      | 複数選択し別directoryに copy                         |
    | m m..R |      | 複数選択し別directoryに 移動                         |
    | m m..S |      | 複数選択し別directoryに シンボリックリンクを作成     |
    | m m..Y |      | 複数選択し別directoryに 相対シンボリックリンクを作成 |
    | m m..M |      | 複数選択しchmod                                      |
    | u      |      | マークを消して下へ                                   |
    | DEL    | C-h  | (Backspace) マークを消して上へ                       |
    | M-DEL  |      | (Alt + Backspace)  すべのマークを消す                |
    | t      |      | マーク反転                                           |
    | /      | <    |                                                      |

** ファイルを開く/閉じる

    | 標準    | 代替キー |     |                                               |
    |---------+----------+-----+-----------------------------------------------|
    | C-x C-f |          |     | ファイル名指定し開く / 新ファイル作成         |
    |         |          |     | ~Find file: ~/~ 　　<--- ファイル名入力       |
    |         | left     |     | ファイル先頭で左は、編集の終了                |
    | C-x C-w |          |     | 名前を付けて保存                              |
    |         |          |     | ~Write file: ~/~ 　<---Enter / ファイル名入力 |
    |         |          |     | ~File `~/xxx' exists; overwrite?~             |
    |         |          |     | ~(y or n)~　　　　　<---y:上書き保存  n:中止  |
    |         |          |     | ~Wrote /home/user/xxx~                        |
    | C-x k   | f4       | s-k | 保存せずに終了                                |
    |         |          |     | ~Buffer xxx modified; kill anyway?~           |
    |         |          |     | ~(yes/no/save and then kill) <---yes:修正破棄 |
    | C-x C-s |          | s-s | 上書き保存                                    |
    |         |          |     | ~Wrote /home/user/xxx~                        |
    | /       | <        |     |                                               |
       


** カーソル移動
*** Windows流
 
    ~→　←　↑　↓　PageUp　PageDown　Cntl+Home　Cntl+End~

*** Mac流

    ~C-f　C-b　C-p　C-n　 fn+up　fn+down　Home　End~

