emacs-help.html


<div id="outline-container-org20ff00c" class="outline-2">
<h2 id="org20ff00c"><span class="section-number-2">2.</span> dired ファイラー表示</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x d</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-D</td>
<td class="org-left">ディレクトリリスト表示</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f5</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カレントディレクトを別画面表示</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">f5</td>
<td class="org-left">s-u</td>
<td class="org-left">ディレクトリ表示更新</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">up</td>
<td class="org-left">k</td>
<td class="org-left">前の行</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left">down</td>
<td class="org-left">j</td>
<td class="org-left">次の行</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-up</td>
<td class="org-left">K</td>
<td class="org-left">１行上スクロール</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-down</td>
<td class="org-left">J</td>
<td class="org-left">１行下スクロール</td>
</tr>

<tr>
<td class="org-left">&lt;</td>
<td class="org-left">P</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">前のdirectory行</td>
</tr>

<tr>
<td class="org-left">&gt;</td>
<td class="org-left">N</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">次のdirectory行</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">home</td>
<td class="org-left">,</td>
<td class="org-left">先頭行へ</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">end</td>
<td class="org-left">.</td>
<td class="org-left">最終行へ</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">right</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">directory降下 または ファイルを開く</td>
</tr>

<tr>
<td class="org-left">^</td>
<td class="org-left">left</td>
<td class="org-left">C-b</td>
<td class="org-left">directory上昇</td>
</tr>

<tr>
<td class="org-left">v</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">View モード (read only) で開く</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">H</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ヘキサモードでファイルを表示</td>
</tr>

<tr>
<td class="org-left">+</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ディレクトリ作成</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">日付順ソート toggle</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">E</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ファイル名直接編集 (C-c C-c で終了)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">A_DIRECTORY へ移動 (.dirrc で定義)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">b</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">B_DIRECTORY へ移動</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">c</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">C_DIRECTORY へ移動</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">E_DIRECTORY へ移動</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">h</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ホームディレクトリ ~ へ移動</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">r</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ルートディレクトリ / へ移動</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">z</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">emacs 起動ディレクトリへ移動</td>
</tr>
</tbody>
</table>
<p>
<br />
    単独ファイルに対して (大文字)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">D</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ファイル削除</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ファイルcopy</td>
</tr>

<tr>
<td class="org-left">R</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">リネーム、移動</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">シンボリックリンク 作成</td>
</tr>

<tr>
<td class="org-left">Y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">相対シンボリックリンク 作成</td>
</tr>

<tr>
<td class="org-left">M</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">chmod</td>
</tr>

<tr>
<td class="org-left">W</td>
<td class="org-left">! open</td>
<td class="org-left">OS標準のアプリで開く(Mac)</td>
</tr>
</tbody>
</table>
<p>
<br />
    マークをつけて、複数ファイルに対して実行
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">　　</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">d d..x</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">削除選択し実行</td>
</tr>

<tr>
<td class="org-left">~ x</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(チルダx) ~付きバックアップファイルを全て選択し削除</td>
</tr>

<tr>
<td class="org-left">m</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">マーク * をつける</td>
</tr>

<tr>
<td class="org-left">m m..D</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">複数選択し削除</td>
</tr>

<tr>
<td class="org-left">m m..C</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">複数選択し別directoryに copy</td>
</tr>

<tr>
<td class="org-left">m m..R</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">複数選択し別directoryに 移動</td>
</tr>

<tr>
<td class="org-left">m m..S</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">複数選択し別directoryに シンボリックリンクを作成</td>
</tr>

<tr>
<td class="org-left">m m..Y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">複数選択し別directoryに 相対シンボリックリンクを作成</td>
</tr>

<tr>
<td class="org-left">m m..M</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">複数選択しchmod</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">マークを消して下へ</td>
</tr>

<tr>
<td class="org-left">DEL</td>
<td class="org-left">C-h</td>
<td class="org-left">(Backspace) マークを消して上へ</td>
</tr>

<tr>
<td class="org-left">M-DEL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(Alt + Backspace)  すべのマークを消す</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">マーク反転</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga0ce255" class="outline-2">
<h2 id="orga0ce255"><span class="section-number-2">3.</span> ファイルを開く/閉じる</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ファイル名指定し開く / 新ファイル作成</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Find file: ~/</code> 　　&lt;&#x2014; ファイル名入力</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">left</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ファイル先頭で左は、編集の終了</td>
</tr>

<tr>
<td class="org-left">C-x C-w</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">名前を付けて保存</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Write file: ~/</code> 　&lt;&#x2014;Enter / ファイル名入力</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>File `~/xxx' exists; overwrite?</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>(y or n)</code>　　　　　&lt;&#x2014;y:上書き保存  n:中止</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Wrote /home/user/xxx</code></td>
</tr>

<tr>
<td class="org-left">C-x k</td>
<td class="org-left">f4</td>
<td class="org-left">s-k</td>
<td class="org-left">保存せずに終了</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Buffer xxx modified; kill anyway?</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">~(yes/no/save and then kill) &lt;&#x2014;yes:修正破棄</td>
</tr>

<tr>
<td class="org-left">C-x C-s</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-s</td>
<td class="org-left">上書き保存</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Wrote /home/user/xxx</code></td>
</tr>
</tbody>
</table>
</div>
</div>



<div id="outline-container-org406c68d" class="outline-2">
<h2 id="org406c68d"><span class="section-number-2">4.</span> カーソル移動</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgbbda50a" class="outline-3">
<h3 id="orgbbda50a"><span class="section-number-3">4.1.</span> Windows流</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>→　←　↑　↓　PageUp　PageDown　Cntl+Home　Cntl+End</code>
</p>
</div>
</div>

<div id="outline-container-orgec99002" class="outline-3">
<h3 id="orgec99002"><span class="section-number-3">4.2.</span> Mac流</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<code>C-f　C-b　C-p　C-n　 fn+up　fn+down　Home　End</code>
</p>
</div>
</div>
