emacs-help.org
** 編集

    viのような入力モード切替はない。入力文字はそのままテキストに追加される。
    | 標準   | 代替キー | 　　 |                                           |
    |--------+----------+------+-------------------------------------------|
    | C-d    | delete   |      | Delete                                    |
    | M-d    |          |      | 一語削除 (cut)                            |
    | DEL    | C-h      |      | Backspace　　　　　(C-h:helpは、f1)       |
    | M-DEL  |          |      | 一語前を削除 (cut)                        |
    | C-k    |          |      | カーソルより後(又は選択領域)を cut (後述) |
    |        | C-S-k    |      | カーソルより後(又は選択領域)を copy       |
    | C-y    |          |      | paste                                     |
    | C-i    | TAB      |      | インデント調整など                        |
    | M-i    |          |      | タブ挿入                                  |
    | C-m    | RET      |      | 改行                                      |
    | C-j    |          |      | 改行してインデント                        |
    | C-M-j  |          |      | 改行して賢くインデント                    |
    | C-o    |          |      | カーソルを残して改行                      |
    | C-M-o  |          |      | カーソルを残して真下に改行                |
    | C-t    |          |      | カーソルの前の文字を後ろに移動            |
    | C-x u  | C-z      | s-z  | undo　　(C-z:suspendは、C-x C-z)          |
    | C-_    | C-/      |      | undo　　(使えないかも)                    |
    | C-g    |          |      | undo の中断。次から undo は redo          |
    | Insert |          |      | 上書きモード .. Ovwrt 表示 (Windows)      |
    | C-\    |          |      | emacs の日本語入力on-off                  |
    | /      | <        |      |                                           |

    ホスト側の日本語入力を使うときは、emacsの日本語入力on-off は不要。ただし\\
    日本語モードでは M- キーが使えないことがある。

** 選択

*** ターミナルの機能

    マウスで選択--> copy されている\\
    右クリック  --> paste

*** Shiftキーをつかった選択

    #+begin_example
    S-left    S-right      S-C-left      S-C-right
    S-up      S-down
    S-Home    S-End        S-C-Home      S-C-End
    S-PageUp  S-PageDown
    C-S-b     C-S-f        M-S-b         M-S-f
    C-S-p     C-S-n
    C-S-a     C-S-e        C-<           C->
    M-S-p     M-S-n
    #+end_example
    Shiftキーを放してカーソル移動すると選択解除

*** Emacsの機能

    | 標準           | 代替キー  | 　　 |                                    |
    |----------------+-----------+------+------------------------------------|
    | C-SPC          | C-@       |      | (Control+Space) 選択開始           |
    |                |           |      | 以後カーソル移動で 選択領域が拡大  |
    | C-x SPC        |           |      | (Control+x Space) 標準矩形選択開始 |
    | C-RET          | C-c C-SPC |      | (Control+Return) cua矩形選択開始   |
    |                |           |      | 以後カーソル移動で 矩形領域が拡大  |
    | C-M-mouse1drag |           |      | マウスで矩形選択                   |
    | C-x h          |           | s-a  | バッファ全選択                     |
    | C-g            |           |      | 選択解除                           |
    | C-d            | delete    |      | 選択領域の削除                     |
    |                |           | s-j  | 領域の開始点と終了点を逆にする     |
    | /              | <         |      |                                    |

*** コピー&ペースト

    | 標準    | 代替キー | 　　 |                                            |
    |---------+----------+------+--------------------------------------------|
    | C-w     | C-x      | s-x  | 選択領域を cut　　(C-x は cua-mode)        |
    | M-w     | C-c      | s-c  | 選択領域を copy　 (C-c は cua-mode)        |
    |         | C-S-w    |      | 選択領域を copy                            |
    | C-y     | C-v      | s-v  | paste　　　　　　 (C-v は cua-mode)        |
    |         |          | s-y  | s-c でcopyしたものをpaste (ターミナル不可) |
    | M-y     |          |      | yank-pop                                   |
    |         |          |      | M-y TAB　　　(kill-ringから選択)           |
    |         |          |      | C-y M-y M-y..　(kill-ringからpop)          |
    | C-k     |          |      | カーソルより後(又は選択領域)を cut (Mac風) |
    |         | C-S-k    |      | カーソルより後(又は選択領域)を copy        |
    | C-S-DEL |          |      | 一行 cut                                   |
    | M-d     |          |      | 一語 cut                                   |
    | M-DEL   |          |      | 一語前を cut                               |
    | M-k     |          |      | 一文 cut                                   |
    | C-M-k   |          |      | 一lisp要素 cut                             |
    | /       | <        |      |                                            |

    copy 後、領域選択は解除、\\
    paste 時、領域が選択されていれば上書き、\\
    選択領域がない時は、C-x と C-c は複数キーのコマンドを構成する。

