emacs-help.html

<div id="outline-container-orgaa9c429" class="outline-2">
<h2 id="orgaa9c429"><span class="section-number-2">6.</span> 編集</h2>
<div class="outline-text-2" id="text-6">
<p>
viのような入力モード切替はない。入力文字はそのままテキストに追加される。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">　　</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-d</td>
<td class="org-left">delete</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Delete</td>
</tr>

<tr>
<td class="org-left">M-d</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">一語削除 (cut)</td>
</tr>

<tr>
<td class="org-left">DEL</td>
<td class="org-left">C-h</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Backspace　　　　　(C-h:helpは、f1)</td>
</tr>

<tr>
<td class="org-left">M-DEL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">一語前を削除 (cut)</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルより後(又は選択領域)を cut (後述)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-S-k</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルより後(又は選択領域)を copy</td>
</tr>

<tr>
<td class="org-left">C-y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">paste</td>
</tr>

<tr>
<td class="org-left">C-i</td>
<td class="org-left">TAB</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">インデント調整など</td>
</tr>

<tr>
<td class="org-left">M-i</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">タブ挿入</td>
</tr>

<tr>
<td class="org-left">C-m</td>
<td class="org-left">RET</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">改行</td>
</tr>

<tr>
<td class="org-left">C-j</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">改行してインデント</td>
</tr>

<tr>
<td class="org-left">C-M-j</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">改行して賢くインデント</td>
</tr>

<tr>
<td class="org-left">C-o</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを残して改行</td>
</tr>

<tr>
<td class="org-left">C-M-o</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを残して真下に改行</td>
</tr>

<tr>
<td class="org-left">C-t</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルの前の文字を後ろに移動</td>
</tr>

<tr>
<td class="org-left">C-x u</td>
<td class="org-left">C-z</td>
<td class="org-left">s-z</td>
<td class="org-left">undo　　(C-z:suspendは、C-x C-z)</td>
</tr>

<tr>
<td class="org-left">C-_</td>
<td class="org-left">C-/</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">undo　　(使えないかも)</td>
</tr>

<tr>
<td class="org-left">C-g</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">undo の中断。次から undo は redo</td>
</tr>

<tr>
<td class="org-left">Insert</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">上書きモード .. Ovwrt 表示 (Windows)</td>
</tr>

<tr>
<td class="org-left">C-\</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">emacs の日本語入力on-off</td>
</tr>
</tbody>
</table>

<p>
ホスト側の日本語入力を使うときは、emacsの日本語入力on-off は不要。ただし<br />
日本語モードでは M- キーが使えないことがある。
</p>
</div>
</div>

<div id="outline-container-orgcdb9299" class="outline-2">
<h2 id="orgcdb9299"><span class="section-number-2">7.</span> 選択</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org81ed0b4" class="outline-3">
<h3 id="org81ed0b4"><span class="section-number-3">7.1.</span> ターミナルの機能</h3>
<div class="outline-text-3" id="text-7-1">
<p>
マウスで選択&#x2013;&gt; copy されている<br />
右クリック  &#x2013;&gt; paste
</p>
</div>
</div>

<div id="outline-container-org1add76c" class="outline-3">
<h3 id="org1add76c"><span class="section-number-3">7.2.</span> Shiftキーをつかった選択</h3>
<div class="outline-text-3" id="text-7-2">
<pre class="example" id="org4bcab3a">
S-left    S-right      S-C-left      S-C-right
S-up      S-down
S-Home    S-End        S-C-Home      S-C-End
S-PageUp  S-PageDown
C-S-b     C-S-f        M-S-b         M-S-f
C-S-p     C-S-n
C-S-a     C-S-e        C-&lt;           C-&gt;
M-S-p     M-S-n
</pre>
<p>
Shiftキーを放してカーソル移動すると選択解除
</p>
</div>
</div>

<div id="outline-container-org7d6a37f" class="outline-3">
<h3 id="org7d6a37f"><span class="section-number-3">7.3.</span> Emacsの機能</h3>
<div class="outline-text-3" id="text-7-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">　　</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-SPC</td>
<td class="org-left">C-@</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(Control+Space) 選択開始</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">以後カーソル移動で 選択領域が拡大</td>
</tr>

<tr>
<td class="org-left">C-x SPC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(Control+x Space) 標準矩形選択開始</td>
</tr>

<tr>
<td class="org-left">C-RET</td>
<td class="org-left">C-c C-SPC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(Control+Return) cua矩形選択開始</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">以後カーソル移動で 矩形領域が拡大</td>
</tr>

<tr>
<td class="org-left">C-M-mouse1drag</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">マウスで矩形選択</td>
</tr>

<tr>
<td class="org-left">C-x h</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-a</td>
<td class="org-left">バッファ全選択</td>
</tr>

<tr>
<td class="org-left">C-g</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">選択解除</td>
</tr>

<tr>
<td class="org-left">C-d</td>
<td class="org-left">delete</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">選択領域の削除</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-j</td>
<td class="org-left">領域の開始点と終了点を逆にする</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org08f0a3b" class="outline-3">
<h3 id="org08f0a3b"><span class="section-number-3">7.4.</span> コピー&amp;ペースト</h3>
<div class="outline-text-3" id="text-7-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">　　</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-w</td>
<td class="org-left">C-x</td>
<td class="org-left">s-x</td>
<td class="org-left">選択領域を cut　　(C-x は cua-mode)</td>
</tr>

<tr>
<td class="org-left">M-w</td>
<td class="org-left">C-c</td>
<td class="org-left">s-c</td>
<td class="org-left">選択領域を copy　 (C-c は cua-mode)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-S-w</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">選択領域を copy</td>
</tr>

<tr>
<td class="org-left">C-y</td>
<td class="org-left">C-v</td>
<td class="org-left">s-v</td>
<td class="org-left">paste　　　　　　 (C-v は cua-mode)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-y</td>
<td class="org-left">s-c でcopyしたものをpaste (ターミナル不可)</td>
</tr>

<tr>
<td class="org-left">M-y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">yank-pop</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">M-y TAB　　　(kill-ringから選択)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-y M-y M-y..　(kill-ringからpop)</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルより後(又は選択領域)を cut (Mac風)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-S-k</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルより後(又は選択領域)を copy</td>
</tr>

<tr>
<td class="org-left">C-S-DEL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">一行 cut</td>
</tr>

<tr>
<td class="org-left">M-d</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">一語 cut</td>
</tr>

<tr>
<td class="org-left">M-DEL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">一語前を cut</td>
</tr>

<tr>
<td class="org-left">M-k</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">一文 cut</td>
</tr>

<tr>
<td class="org-left">C-M-k</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">一lisp要素 cut</td>
</tr>
</tbody>
</table>

<p>
copy 後、領域選択は解除、<br />
paste 時、領域が選択されていれば上書き、<br />
選択領域がない時は、C-x と C-c は複数キーのコマンドを構成する。
</p>
</div>
</div>
</div>
