emacs-help.org
** View モード (read only)

    | 標準          | 代替キー | 　　 |                              |
    |---------------+----------+------+------------------------------|
    | M-x view-file | v(dired) |      | ファイルを View モードで開く |
    | M-x view-mode | ESC-f1   |      | バッファを View モードに     |
    |               | f5       |      | 変更を読み込む               |
    | E             | i        |      | View モードから通常モードに  |
    | q             | :q       |      | View バッファを削除          |
    |               | :w       |      | 上書き保存                   |
    |               | h        |      | カーソルを一文字左           |
    |               | j        |      | カーソルを一行上             |
    |               | k        |      | カーソルを一行下             |
    |               | l        |      | カーソルを一文字右           |
    |               | a        |      | 画面上の行頭へ               |
    |               | e        |      | 画面上の行末へ               |
    |               | f        |      | カーソルを一文字進める       |
    |               | b        |      | カーソルを一文字戻す         |
    |               | H        |      | カーソルを画面上             |
    |               | M        |      | カーソルを画面中央           |
    |               | L        |      | カーソルを画面下             |
    | u             |          |      | 半画面上スクロール           |
    | d             |          |      | 半画面下スクロール           |
    | DEL           |          |      | 画面上スクロール             |
    | SPC           |          |      | 画面下スクロール             |
    | y             | K        |      | １行上スクロール             |
    | RET           | J        |      | １行下スクロール             |
    | <             | g        |      | ファイル先頭へ               |
    | >             | G        | o    | ファイル末尾へ               |
    | 数値 g        |          |      | 指定行へ                     |
    | s             | C-s      |      | インクリメンタルサーチ       |
    | r             |          |      | 逆方向クリメンタルサーチ     |
    | \slash{}      | C-M-s    |      | 正規表現検索                 |
    | \             |          |      | 逆方向正規表現検索           |
    | n             |          |      | 再検索                       |
    | p             | N        |      | 逆方向再検索                 |
    | .             |          |      | 選択開始                     |
    | +             |          |      | 領域の開始点と終了点を逆に   |
    |               | f5       |      | 外部でのファイル変更を反映   |
    | /             | <        |      |                              |

    Read only の View モードでは vi 的なキー操作もできる。\\
    書き込み可能な通常モードへの遷移は "i" と "ESC-f1"。\\
    ファイルを変更して ":q" で終了するとき破棄確認 yes/no/save される。


** 再表示

    | 標準 | 代替キー |                                      |
    |------+----------+--------------------------------------|
    | C-l  |          | 画面再表示、カーソル行を中央、上、下 |
    |      | f5       | 画面再表示                           |
    | /    | <        |                                      |

    
** マルチ画面

*** 画面分割

    | 標準        | 代替キー |     |                                       |
    |-------------+----------+-----+---------------------------------------|
    | C-x 2       | f2       |     | 画面分割 上下 (一画面の時) / 分割解除 |
    | C-x 3       | S-f2     |     | 画面分割 左右 (一画面の時)            |
    | C-x 1       | f2       |     | 分割解除 (選択中の画面だけ残す)       |
    | C-x o       | S-f1     |     | 次の画面へ移動                        |
    |             | S-f2     |     | 前の画面へ移動 (分割時)               |
    |             | C-TAB    |     | 次の画面へ移動 (1フレームの時)        |
    |             | C-S-TAB  |     | 前の画面へ移動 (1フレームの時)        |
    | C-x k       | f4       | s-k | バッファの削除。修正中なら確認        |
    | C-x 0       | S-f4     |     | 分割解除 (選択中の画面を閉じる)       |
    | C-x C-left  | C-next   |     | バッファ切替 奥へ (Ctrl + PageDown)   |
    | C-x C-right | C-prior  |     | バッファ切替 戻る (Ctrl + PageUp)     |
    |             | f7       |     | 画面縮小 f(自動又は) 上下             |
    | C-x ^       | f8       |     | 画面拡大 f(自動又は) 上下             |
    | C-x {       | S-f7     |     | 画面縮小 f(自動又は) 左右             |
    | C-x }       | S-f8     |     | 画面拡大 f(自動又は) 左右             |
    | C-x C-b     |          |     | バッファリスト表示                    |
    |             | f10      |     | 分割時、上下または左右を交換          |
    |             | S-f10    |     | 分割時、画面しきりを回転する          |
    | /           | <        |     |                                       |

*** 次画面の操作

    | 標準    | 代替キー |   |                                      |
    |---------+----------+---+--------------------------------------|
    | C-M-v   | M-next   |   | 下画面                               |
    | C-M-S-v | M-prior  |   | 上画面                               |
    | M-home  |          |   | バッファ先頭                         |
    | M-end   |          |   | バッファ末尾                         |
    |         | M-down   |   | １行下スクロール                     |
    |         | M-up     |   | １行上スクロール                     |
    |         | M-S-down |   | Ｎ行下高速スクロール                 |
    |         | M-S-up   |   | Ｎ行上高速スクロール                 |
    | C-M-S-l |          |   | 画面再表示、カーソル行を中央、上、下 |
    | /       | <        |   |                                      |

