emacs-help.html

<div id="outline-container-orgc5c0865" class="outline-2">
<h2 id="orgc5c0865"><span class="section-number-2">8.</span> View モード (read only)</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">　　</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-x view-file</td>
<td class="org-left">v(dired)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ファイルを View モードで開く</td>
</tr>

<tr>
<td class="org-left">M-x view-mode</td>
<td class="org-left">ESC-f1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">バッファを View モードに</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f5</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">変更を読み込む</td>
</tr>

<tr>
<td class="org-left">E</td>
<td class="org-left">i</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">View モードから通常モードに</td>
</tr>

<tr>
<td class="org-left">q</td>
<td class="org-left">:q</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">View バッファを削除</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">:w</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">上書き保存</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">h</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを一文字左</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">j</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを一行上</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">k</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを一行下</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">l</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを一文字右</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a</td>
<td class="org-left">0</td>
<td class="org-left">画面上の行頭へ</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e</td>
<td class="org-left">$</td>
<td class="org-left">画面上の行末へ</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを一文字進める</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">b</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを一文字戻す</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">H</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを画面上</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">M</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを画面中央</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">L</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソルを画面下</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">^</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">半画面上スクロール</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">v</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">半画面下スクロール</td>
</tr>

<tr>
<td class="org-left">DEL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1画面上スクロール</td>
</tr>

<tr>
<td class="org-left">SPC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1画面下スクロール</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">K</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">１行上スクロール</td>
</tr>

<tr>
<td class="org-left">RET</td>
<td class="org-left">J</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">１行下スクロール</td>
</tr>

<tr>
<td class="org-left">&lt;</td>
<td class="org-left">g</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ファイル先頭へ</td>
</tr>

<tr>
<td class="org-left">&gt;</td>
<td class="org-left">G</td>
<td class="org-left">o</td>
<td class="org-left">ファイル末尾へ</td>
</tr>

<tr>
<td class="org-left">数値 g</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">指定行へ</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">C-s</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">インクリメンタルサーチ</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">逆方向クリメンタルサーチ</td>
</tr>

<tr>
<td class="org-left">/</td>
<td class="org-left">C-M-s</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">正規表現検索</td>
</tr>

<tr>
<td class="org-left">\</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">逆方向正規表現検索</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left">f3</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">再検索</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">S-f3</td>
<td class="org-left">N</td>
<td class="org-left">逆方向再検索</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">選択開始</td>
</tr>

<tr>
<td class="org-left">+</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">領域の開始点と終了点を逆に</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f5</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">外部でのファイル変更を反映</td>
</tr>
</tbody>
</table>

<p>
Read only の View モードでは vi 的なキー操作もできる。<br />
書き込み可能な通常モードへの遷移は "i" と "ESC-f1"。<br />
ファイルを変更して ":q" で終了するとき破棄確認 yes/no/save される。
</p>
</div>
</div>


<div id="outline-container-orgb816540" class="outline-2">
<h2 id="orgb816540"><span class="section-number-2">9.</span> 再表示</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-l</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">画面再表示、カーソル行を中央、上、下</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f5</td>
<td class="org-left">画面再表示</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgb18c3c4" class="outline-2">
<h2 id="orgb18c3c4"><span class="section-number-2">10.</span> マルチ画面</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org686c781" class="outline-3">
<h3 id="org686c781"><span class="section-number-3">10.1.</span> 画面分割</h3>
<div class="outline-text-3" id="text-10-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x 2</td>
<td class="org-left">f2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">画面分割 上下 (一画面の時) / 分割解除</td>
</tr>

<tr>
<td class="org-left">C-x 3</td>
<td class="org-left">S-f2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">画面分割 左右 (一画面の時)</td>
</tr>

<tr>
<td class="org-left">C-x 1</td>
<td class="org-left">f2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">分割解除 (選択中の画面だけ残す)</td>
</tr>

<tr>
<td class="org-left">C-x o</td>
<td class="org-left">S-f1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">次の画面へ移動</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">前の画面へ移動 (分割時)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-TAB</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">次の画面へ移動 (1フレームの時)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-S-TAB</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">前の画面へ移動 (1フレームの時)</td>
</tr>

<tr>
<td class="org-left">C-x k</td>
<td class="org-left">f4</td>
<td class="org-left">s-k</td>
<td class="org-left">バッファの削除。修正中なら確認</td>
</tr>

<tr>
<td class="org-left">C-x 0</td>
<td class="org-left">S-f4</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">分割解除 (選択中の画面を閉じる)</td>
</tr>

<tr>
<td class="org-left">C-x C-left</td>
<td class="org-left">C-next</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">バッファ切替 奥へ (Ctrl + PageDown)</td>
</tr>

<tr>
<td class="org-left">C-x C-right</td>
<td class="org-left">C-prior</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">バッファ切替 戻る (Ctrl + PageUp)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">画面縮小 f(自動又は) 上下</td>
</tr>

<tr>
<td class="org-left">C-x ^</td>
<td class="org-left">f8</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">画面拡大 f(自動又は) 上下</td>
</tr>

<tr>
<td class="org-left">C-x {</td>
<td class="org-left">S-f7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">画面縮小 f(自動又は) 左右</td>
</tr>

<tr>
<td class="org-left">C-x }</td>
<td class="org-left">S-f8</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">画面拡大 f(自動又は) 左右</td>
</tr>

<tr>
<td class="org-left">C-x C-b</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">バッファリスト表示</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">分割時、上下または左右を交換</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">分割時、画面しきりを回転する</td>
</tr>
</tbody>
</table>
</div>
</div>
