emacs-help.org
*** フレーム

    | 標準    | 代替キー |     |                              |
    |---------+----------+-----+------------------------------|
    | C-x 5 2 |          | s-n | フレーム作成                 |
    | C-x 5 0 |          | s-w | フレーム削除                 |
    | C-x 5 o |          | s-` | 次のフレーム                 |
    |         |          | s-~ | 前のフレーム                 |
    |         | C-TAB    | s-' | 次の画面またはフレームへ移動 |
    |         | C-S-TAB  |     | 前の画面またはフレームへ移動 |
    | /       | <        |     |                              |


** 文字コードの指定
*** コマンド実行の前に指定

    ~M-x universal-coding-system-argument~
    | 標準      | 代替キー |                                          |
    |-----------+----------+------------------------------------------|
    | C-x RET c | f6       | コーディングシステムを指定しコマンド実行 |
    | /         | <        |                                          |
    	
    ~Coding system for following command (default utf-8-unix): sjis-dos~\\
    ~Command to execute with sjis-dos:~　　　　ここで C-x C-w などコマンド実行

*** 読み込んだファイルの変更     

    ~M-x set-buffer-file-coding-system~
    | 標準      | 　　　 |                                              |
    |-----------+--------+----------------------------------------------|
    | C-x RET f |        | 読み込みバッファ内コーディングシステムの変更 |
    | /         | <      |                                              |

    ~Coding system for saving file (default iso-2022-jp):~

*** 文字コード表示

    改行と文字コードの指定方法
    | 改行 \ 文字    | UTF-8      | S-JISC    | EUC         | JIS        | 改行表示 |
    |----------------+------------+-----------+-------------+------------+----------|
    | lf             | utf-8-unix | sjis-unix | euc-jp-unix | junet-unix | :        |
    | crlf           | utf-8-dos  | sjis-dos  | euc-jp-dos  | junet-dos  | (DOS)    |
    | cr             | utf-8-mac  | sjis-mac  | euc-jp-mac  | junet-mac  | (Mac)    |
    | 文字コード表示 | U          | S         | E           | J          |          |
    | /              | <          |           |             | >          |          |
     
    #+begin_example
    例
    -UUU:**--F1  emacs-help.org   52% (300,85)   (Org) 2:02PM 1.68 ----------------------
    -UUS(DOS)----F1  KOSMAX.CNF     Top (1,0)     Git-main  (Fundamental) 2:03PM 1.17 ---
    #+end_example
     
    lf (¥n) は unix と Mac OSX, crlf (¥r¥n) は Windows で使われる。\\
    cr (¥r) は古い Macで使われていた。

    通常はファイル読込時、文字コードを自動認識するが、誤認識する場合は f6 で指定する。
    
    強制的に eucで読み込む場合 (半角カナによる文字化け対策)\\
              ~f6 euc Enter C-x C-f filename~
		
    EUC+cr で上書き保存\\
              ~f6 euc-jp-unix Enter C-x C-s~


** 文字サイズの変更

    画面が細かい時、文字サイズを大きくしたりできる。
    
    | 標準    | 代替キー |     |                      |
    |---------+----------+-----+----------------------|
    | C-x C-+ |          | s-+ | 文字を大きく         |
    | C-x C-- |          | s-- | 文字を小さく         |
    | C-x C-0 |          | s-0 | デフォルトの大きさに |
    | /       | <        |     |                      |



** いろいろなコマンド

    | M-x diff                    |           |           | ファイル比較           |
    | M-x compile                 |           |           | メーク実行             |
    | M-x gdb                     |           |           | デバッガ起動           |
    | M-x grep                    |           |           | grep 実行              |
    | M-x grep-find               |           |           | find し grep実行       |
    | M-x occur                   |           |           | 表示内容を検索しリスト |
    | M-x shell                   | M-x s     |           | 内部シェル起動         |
    | M-x shell-command           | M-!       | s-L       | 単発コマンド実行       |
    | M-x shell-command-on-region | M-\vert{} | s-\vert{} | +選択領域を入力        |
    | M-x man                     |           | s-M       | Man page 表示          |
    | M-x info                    | f1 i      | s-?       | info 表示              |
    | /                           | <         |           |                        |

*** コマンドに与える引数

    | M-3 a            | aaa 入力       |
    | C-u 3 a          | aaa 入力       |
    | M-5 M-x occur    | 前後5行表示    |
    | C-u 5 M-x occur  | 前後5行表示    |
    | C-u -5 M-x occur | 前5行表示      |
    | C-u C-f          | 前へ4文字進む  |
    | C-u C-u C-f      | 前へ16文字進む |

