emacs-help.html

<div id="outline-container-org6a381f2" class="outline-3">
<h3 id="org6a381f2"><span class="section-number-3">10.2.</span> 次画面の操作</h3>
<div class="outline-text-3" id="text-10-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-M-v</td>
<td class="org-left">M-next</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">下画面</td>
</tr>

<tr>
<td class="org-left">C-M-S-v</td>
<td class="org-left">M-prior</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">上画面</td>
</tr>

<tr>
<td class="org-left">M-home</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">バッファ先頭</td>
</tr>

<tr>
<td class="org-left">M-end</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">バッファ末尾</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">M-down</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">１行下スクロール</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">M-up</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">１行上スクロール</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">M-S-down</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ｎ行下高速スクロール</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">M-S-up</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Ｎ行上高速スクロール</td>
</tr>

<tr>
<td class="org-left">C-M-S-l</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">画面再表示、カーソル行を中央、上、下</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org330ccca" class="outline-3">
<h3 id="org330ccca"><span class="section-number-3">10.3.</span> フレーム</h3>
<div class="outline-text-3" id="text-10-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x 5 2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-n</td>
<td class="org-left">フレーム作成</td>
</tr>

<tr>
<td class="org-left">C-x 5 0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-w</td>
<td class="org-left">フレーム削除</td>
</tr>

<tr>
<td class="org-left">C-x 5 o</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-`</td>
<td class="org-left">次のフレーム</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-~</td>
<td class="org-left">前のフレーム</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-TAB</td>
<td class="org-left">s-'</td>
<td class="org-left">次の画面またはフレームへ移動</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-S-TAB</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">前の画面またはフレームへ移動</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org9620932" class="outline-2">
<h2 id="org9620932"><span class="section-number-2">11.</span> 文字コードの指定</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgb0ca706" class="outline-3">
<h3 id="orgb0ca706"><span class="section-number-3">11.1.</span> コマンド実行の前に指定</h3>
<div class="outline-text-3" id="text-11-1">
<p>
<code>M-x universal-coding-system-argument</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x RET c</td>
<td class="org-left">f6</td>
<td class="org-left">コーディングシステムを指定しコマンド実行</td>
</tr>
</tbody>
</table>

<p>
<code>Coding system for following command (default utf-8-unix): sjis-dos</code><br />
<code>Command to execute with sjis-dos:</code>　　　　ここで C-x C-w などコマンド実行
</p>
</div>
</div>

<div id="outline-container-org7c4a93b" class="outline-3">
<h3 id="org7c4a93b"><span class="section-number-3">11.2.</span> 読み込んだファイルの変更</h3>
<div class="outline-text-3" id="text-11-2">
<p>
<code>M-x set-buffer-file-coding-system</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">　　　</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x RET f</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">読み込みバッファ内コーディングシステムの変更</td>
</tr>
</tbody>
</table>

<p>
<code>Coding system for saving file (default iso-2022-jp):</code>
</p>
</div>
</div>

<div id="outline-container-org68c5056" class="outline-3">
<h3 id="org68c5056"><span class="section-number-3">11.3.</span> 文字コード表示</h3>
<div class="outline-text-3" id="text-11-3">
<p>
改行と文字コードの指定方法
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">改行 \ 文字</th>
<th scope="col" class="org-left">UTF-8</th>
<th scope="col" class="org-left">S-JISC</th>
<th scope="col" class="org-left">EUC</th>
<th scope="col" class="org-left">JIS</th>
<th scope="col" class="org-left">改行表示</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">lf</td>
<td class="org-left">utf-8-unix</td>
<td class="org-left">sjis-unix</td>
<td class="org-left">euc-jp-unix</td>
<td class="org-left">junet-unix</td>
<td class="org-left">:</td>
</tr>

<tr>
<td class="org-left">crlf</td>
<td class="org-left">utf-8-dos</td>
<td class="org-left">sjis-dos</td>
<td class="org-left">euc-jp-dos</td>
<td class="org-left">junet-dos</td>
<td class="org-left">(DOS)</td>
</tr>

<tr>
<td class="org-left">cr</td>
<td class="org-left">utf-8-mac</td>
<td class="org-left">sjis-mac</td>
<td class="org-left">euc-jp-mac</td>
<td class="org-left">junet-mac</td>
<td class="org-left">(Mac)</td>
</tr>

<tr>
<td class="org-left">文字コード表示</td>
<td class="org-left">U</td>
<td class="org-left">S</td>
<td class="org-left">E</td>
<td class="org-left">J</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<pre class="example" id="org6243b93">
例
-UUU:**--F1  emacs-help.org   52% (300,85)   (Org) 2:02PM 1.68 ----------------------
-UUS(DOS)----F1  KOSMAX.CNF     Top (1,0)     Git-main  (Fundamental) 2:03PM 1.17 ---
</pre>

<p>
lf (¥n) は unix と Mac OSX, crlf (¥r¥n) は Windows で使われる。<br />
cr (¥r) は古い Macで使われていた。
</p>

<p>
通常はファイル読込時、文字コードを自動認識するが、誤認識する場合は f6 で指定する。
</p>

<p>
強制的に eucで読み込む場合 (半角カナによる文字化け対策)<br />
	  <code>f6 euc Enter C-x C-f filename</code>
</p>

<p>
EUC+cr で上書き保存<br />
	  <code>f6 euc-jp-unix Enter C-x C-s</code>
</p>
</div>
</div>
</div>


<div id="outline-container-org2c65203" class="outline-2">
<h2 id="org2c65203"><span class="section-number-2">12.</span> 文字サイズの変更</h2>
<div class="outline-text-2" id="text-12">
<p>
画面が細かい時、文字サイズを大きくしたりできる。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x C-+</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-+</td>
<td class="org-left">文字を大きく</td>
</tr>

<tr>
<td class="org-left">C-x C--</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s--</td>
<td class="org-left">文字を小さく</td>
</tr>

<tr>
<td class="org-left">C-x C-0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-0</td>
<td class="org-left">デフォルトの大きさに</td>
</tr>
</tbody>
</table>
</div>
</div>



<div id="outline-container-org6d07dc6" class="outline-2">
<h2 id="org6d07dc6"><span class="section-number-2">13.</span> いろいろなコマンド</h2>
<div class="outline-text-2" id="text-13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">M-x diff</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ファイル比較</td>
</tr>

<tr>
<td class="org-left">M-x compile</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">メーク実行</td>
</tr>

<tr>
<td class="org-left">M-x gdb</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">デバッガ起動</td>
</tr>

<tr>
<td class="org-left">M-x grep</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">grep 実行</td>
</tr>

<tr>
<td class="org-left">M-x grep-find</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">find し grep実行</td>
</tr>

<tr>
<td class="org-left">M-x occur</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">表示内容を検索しリスト</td>
</tr>

<tr>
<td class="org-left">M-x shell</td>
<td class="org-left">M-s M-s</td>
<td class="org-left">M-x s</td>
<td class="org-left">内部シェル起動</td>
</tr>

<tr>
<td class="org-left">M-x shell-command</td>
<td class="org-left">M-!</td>
<td class="org-left">s-L</td>
<td class="org-left">単発コマンド実行</td>
</tr>

<tr>
<td class="org-left">M-x shell-command-on-region</td>
<td class="org-left">M-&vert;</td>
<td class="org-left">s-&vert;</td>
<td class="org-left">+選択領域を入力</td>
</tr>

<tr>
<td class="org-left">M-x man</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-M</td>
<td class="org-left">Man page 表示</td>
</tr>

<tr>
<td class="org-left">M-x info</td>
<td class="org-left">f1 i</td>
<td class="org-left">s-?</td>
<td class="org-left">info 表示</td>
</tr>
</tbody>
</table>
</div>
