emacs-help.org
*** 内部シェルの起動

    | 標準      | 代替キー |    |                                 |
    |-----------+----------+----+---------------------------------|
    | M-x shell | M-x s    |    | シェル起動                      |
    | M-p       | up       |    | history 前                      |
    | M-n       | down     |    | history 次                      |
    | string up |          |    | 先頭文字列から始まる history 前 |
    | M-x dirs  | M-RET    | f5 | ディレクトリ認識ズレ修正        |
    | C-p       |          |    | カーソル上                      |
    | C-n       |          |    | カーソル下                      |
    | C-d       |          |    | EOF (promptのところで)          |
    | C-c C-c   |          |    | シェル中断                      |
    | /         | <        |    |                                 |
    
** 終了、中断

    | 標準    | 代替キー |     |                                      |
    |---------+----------+-----+--------------------------------------|
    | C-x C-c |          | s-q | emacs の終了                         |
    | C-x C-z |          | s-m | suspend　　　　　　　(C-z はundo)    |
    | fg      |          |     | (コマンド) シェルからEmacsに復帰する |
    | /       | <        |     |                                      |


** function key 設定一覧

    | 標準        | 代替キー |         |                                        |
    |-------------+----------+---------+----------------------------------------|
    | f1          |          |         | M-x help　　(C-h は backspace)         |
    | C-x o       | S-f1     | C-TAB   | other-window 　　　　(順周り)          |
    | C-x 2       | f2       |         | split-window-below ー toggle           |
    | C-x 1       | f2       |         | delete-other-windows                   |
    | C-x 3       | S-f2     |         | split-window-right \vert{}             |
    |             | S-f2     | C-S-TAB | other-window 　　　　(逆回り)          |
    | C-s C-s     | f3       | s-g     | isearch-repeat-forward                 |
    | C-s C-r C-r | S-f3     | s-d     | isearch-repeat-backward                |
    | C-x k       | f4       | s-k     | kill-current-buffer                    |
    | C-x 0       | S-f4     |         | delete-window                          |
    | g           | f5       | s-u     | revert-buffer (dired mode)             |
    |             | f5       | s-u     | revert-buffer (view mode)              |
    | M-x dirs    | f5       | M-RET   | shell-resync-dirs (shell mode)         |
    | C-l         | f5       |         | recenter                               |
    | C-x d       | S-f5     | s-D     | dired                                  |
    | C-x RET c   | f6       |         | select coding system                   |
    |             | S-f6     |         | toggle electric-indent-mode            |
    |             | ESC-f6   |         | macro start                            |
    |             | C-f6     |         | macro end/call macro                   |
    |             | f7       |         | shrink window                          |
    | C-x ^       | f8       |         | enlarge-window                         |
    | C-x {       | S-f7     |         | shrink-window-horizontally             |
    | C-x }       | S-f8     |         | enlarge-window-horizontally            |
    | f1 k        | f9       |         | describe-key-briefly                   |
    |             | S-f9     |         | toggle case sensitive (search / occur) |
    |             | f10      |         | swap split window                      |
    |             | S-f10    |         | toggle vertical / horizontal split     |
    | M-f10       |          |         | toggle-frame-maximized                 |
    |             | M-f11    |         | toggle-frame-fullscreen                |
    |             | f11      |         | toggle-trancate-lines                  |
    |             | f12      |         | global-display-line-numbers-mode       |
    |             | S-f11    |         | scroll-right                           |
    |             | S-f12    |         | scroll-left                            |
    | /           | <        |         |                                        |


