emacs-help.html

<div id="outline-container-orgaa20f39" class="outline-3">
<h3 id="orgaa20f39"><span class="section-number-3">13.1.</span> コマンドに与える引数</h3>
<div class="outline-text-3" id="text-13-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">M-3 a</td>
<td class="org-left">aaa 入力</td>
</tr>

<tr>
<td class="org-left">C-u 3 a</td>
<td class="org-left">aaa 入力</td>
</tr>

<tr>
<td class="org-left">M-5 M-x occur</td>
<td class="org-left">前後5行表示</td>
</tr>

<tr>
<td class="org-left">C-u 5 M-x occur</td>
<td class="org-left">前後5行表示</td>
</tr>

<tr>
<td class="org-left">C-u -5 M-x occur</td>
<td class="org-left">前5行表示</td>
</tr>

<tr>
<td class="org-left">C-u C-f</td>
<td class="org-left">前へ4文字進む</td>
</tr>

<tr>
<td class="org-left">C-u C-u C-f</td>
<td class="org-left">前へ16文字進む</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc50db57" class="outline-3">
<h3 id="orgc50db57"><span class="section-number-3">13.2.</span> 内部シェルの起動</h3>
<div class="outline-text-3" id="text-13-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-x shell</td>
<td class="org-left">M-s M-s</td>
<td class="org-left">M-x s</td>
<td class="org-left">シェル起動</td>
</tr>

<tr>
<td class="org-left">M-p</td>
<td class="org-left">up</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">history 前</td>
</tr>

<tr>
<td class="org-left">M-n</td>
<td class="org-left">down</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">history 次</td>
</tr>

<tr>
<td class="org-left">string up</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">先頭文字列から始まる history 前</td>
</tr>

<tr>
<td class="org-left">M-x dirs</td>
<td class="org-left">M-RET</td>
<td class="org-left">S-f5</td>
<td class="org-left">ディレクトリ認識ズレ修正</td>
</tr>

<tr>
<td class="org-left">C-p</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソル上</td>
</tr>

<tr>
<td class="org-left">C-n</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">カーソル下</td>
</tr>

<tr>
<td class="org-left">C-d</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">EOF (promptのところで)</td>
</tr>

<tr>
<td class="org-left">C-c C-c</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">シェル中断</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgdff1780" class="outline-2">
<h2 id="orgdff1780"><span class="section-number-2">14.</span> 終了、中断</h2>
<div class="outline-text-2" id="text-14">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x C-c</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-q</td>
<td class="org-left">emacs の終了</td>
</tr>

<tr>
<td class="org-left">C-x C-z</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-m</td>
<td class="org-left">suspend　　　　　　　(C-z はundo)</td>
</tr>

<tr>
<td class="org-left">fg</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(コマンド) シェルからEmacsに復帰する</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org5a1ba29" class="outline-2">
<h2 id="org5a1ba29"><span class="section-number-2">15.</span> function key 設定一覧</h2>
<div class="outline-text-2" id="text-15">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">M-x help　　(C-h は backspace)</td>
</tr>

<tr>
<td class="org-left">C-x o</td>
<td class="org-left">S-f1</td>
<td class="org-left">C-TAB</td>
<td class="org-left">other-window 　　　　(順周り)</td>
</tr>

<tr>
<td class="org-left">C-x 2</td>
<td class="org-left">f2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">split-window-below ー toggle</td>
</tr>

<tr>
<td class="org-left">C-x 1</td>
<td class="org-left">f2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">delete-other-windows</td>
</tr>

<tr>
<td class="org-left">C-x 3</td>
<td class="org-left">S-f2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">split-window-right &vert;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f2</td>
<td class="org-left">C-S-TAB</td>
<td class="org-left">other-window 　　　　(逆回り)</td>
</tr>

<tr>
<td class="org-left">C-s C-s</td>
<td class="org-left">f3</td>
<td class="org-left">s-g</td>
<td class="org-left">isearch-repeat-forward</td>
</tr>

<tr>
<td class="org-left">C-s C-r C-r</td>
<td class="org-left">S-f3</td>
<td class="org-left">s-d</td>
<td class="org-left">isearch-repeat-backward</td>
</tr>

<tr>
<td class="org-left">C-x k</td>
<td class="org-left">f4</td>
<td class="org-left">s-k</td>
<td class="org-left">kill-current-buffer</td>
</tr>

<tr>
<td class="org-left">C-x 0</td>
<td class="org-left">S-f4</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">delete-window</td>
</tr>

<tr>
<td class="org-left">C-x d</td>
<td class="org-left">f5</td>
<td class="org-left">s-D</td>
<td class="org-left">dired</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">f5</td>
<td class="org-left">s-u</td>
<td class="org-left">revert-buffer (dired mode)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f5</td>
<td class="org-left">s-u</td>
<td class="org-left">revert-buffer (view mode)</td>
</tr>

<tr>
<td class="org-left">M-x dirs</td>
<td class="org-left">S-f5</td>
<td class="org-left">M-RET</td>
<td class="org-left">shell-resync-dirs (shell mode)</td>
</tr>

<tr>
<td class="org-left">C-l</td>
<td class="org-left">S-f5</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">recenter</td>
</tr>

<tr>
<td class="org-left">C-x RET c</td>
<td class="org-left">f6</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">select coding system</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f6</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">toggle electric-indent-mode</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">ESC-f6</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">macro start</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C-f6</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">macro end/call macro</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">shrink window</td>
</tr>

<tr>
<td class="org-left">C-x ^</td>
<td class="org-left">f8</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">enlarge-window</td>
</tr>

<tr>
<td class="org-left">C-x {</td>
<td class="org-left">S-f7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">shrink-window-horizontally</td>
</tr>

<tr>
<td class="org-left">C-x }</td>
<td class="org-left">S-f8</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">enlarge-window-horizontally</td>
</tr>

<tr>
<td class="org-left">f1 k</td>
<td class="org-left">f9</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">describe-key-briefly</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f9</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">toggle case sensitive (search / occur)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">swap split window</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">toggle vertical / horizontal split</td>
</tr>

<tr>
<td class="org-left">M-f10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">toggle-frame-maximized</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">M-f11</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">toggle-frame-fullscreen</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f11</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">toggle-trancate-lines</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">f12</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">global-display-line-numbers-mode</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f11</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">scroll-right</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">S-f12</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">scroll-left</td>
</tr>
</tbody>
</table>
</div>
</div>
