emacs-help.org
** help

    | 標準      | 代替キー |     |                                       |
    |-----------+----------+-----+---------------------------------------|
    | f1        |          |     | ヘルプメニューで選択                  |
    | f1 a      |          |     | command-apropos : 似たコマンド名表示  |
    | f1 b      |          |     | describe-bindings : キーバインド一覧  |
    | f1 f      |          |     | describe-function : 関数説明          |
    | f1 k<key> | f9<key>  |     | describe-key : キーの割り当て関数表示 |
    | f1 i      |          | s-? | info : info 表示                      |
    | f1 m      |          |     | describe-mode : モード説明            |
    | f1 v      |          |     | describe-variable : 変数説明          |
    | f1 w      |          |     | where-is : 関数の割り当てキー表示     |
    | /         | <        |     |                                       |

*** ヘルプ画面集
**** メニュー
    f1
    
    #+Begin_example
    You have typed , the help character.  Type a Help option:
    (Use SPC or DEL to scroll through this text.  Type q to exit the Help command.)
     
    a PATTERN   Show commands whose name matches the PATTERN (a list of words
                  or a regexp).  See also the ‘apropos’ command.
    b           Display all key bindings.
    c KEYS      Display the command name run by the given key sequence.
    C CODING    Describe the given coding system, or RET for current ones.
    d PATTERN   Show a list of functions, variables, and other items whose
                  documentation matches the PATTERN (a list of words or a regexp).
    e           Go to the *Messages* buffer which logs echo-area messages.
    f FUNCTION  Display documentation for the given function.
    F COMMAND   Show the Emacs manual’s section that describes the command.
    g           Display information about the GNU project.
    h           Display the HELLO file which illustrates various scripts.
    i           Start the Info documentation reader: read included manuals.
    I METHOD    Describe a specific input method, or RET for current.
    k KEYS      Display the full documentation for the key sequence.
    K KEYS      Show the Emacs manual’s section for the command bound to KEYS.
    l           Show last 300 input keystrokes (lossage).
    L LANG-ENV  Describe a specific language environment, or RET for current.
    m           Display documentation of current minor modes and current major mode,
                  including their special commands.
    n           Display news of recent Emacs changes.
    o SYMBOL    Display the given function or variable’s documentation and value.
    p TOPIC     Find packages matching a given topic keyword.
    P PACKAGE   Describe the given Emacs Lisp package.
    r           Display the Emacs manual in Info mode.
    s           Display contents of current syntax table, plus explanations.
    S SYMBOL    Show the section for the given symbol in the Info manual
                  for the programming language used in this buffer.
    t           Start the Emacs learn-by-doing tutorial.
    v VARIABLE  Display the given variable’s documentation and value.
    w COMMAND   Display which keystrokes invoke the given command (where-is).
    .           Display any available local help at point in the echo area.
     
    C-a         Information about Emacs.
    C-c         Emacs copying permission (GNU General Public License).
    C-d         Instructions for debugging GNU Emacs.
    C-e         External packages and information about Emacs.
    C-f         Emacs FAQ.
    C-m         How to order printed Emacs manuals.
    C-n         News of recent Emacs changes.
    C-o         Emacs ordering and distribution information.
    C-p         Info about known Emacs problems.
    C-s         Search forward "help window".
    C-t         Emacs TODO list.
    C-w         Information on absence of warranty for GNU Emacs.
    #+end_example

**** tutorial
    f1 t
    
    #+begin_example
    --------------------Tutorial  画面の例---------------------------------
    Copyright (c) 1985 Free Software Foundation, Inc;  ファイル最後を参照のこと
     	   あなたが現在見ているのは Emacs 入門ガイドです。
     
    Emacs のコマンドを入力するには、一般にコントロールキー（キートップに
    CTRL とか CTL と書いてある）やメタキー（キートップに META とか ALT と
    書いてある）を使います。そこで、CONTROL とか META とか書く代わりに、次
    のような記号を使うことにします。
     
     C-<文字>   コントロールキーを押したまま、<文字>キーを押します。例えば、
     	    C-f はコントロールキーを押しながら f のキーを押すことです。
     
     M-<文字>   メタキーを押したまま、<文字>キーを押します。もしメタキーがな
     	    い場合は、エスケープキーを押してから離し、それから<文字>キー
     	    を押します。以降エスケープキーのことを <ESC> と書きます。
     
    ！重要！: Emacsを終了するには、C-x C-c をタイプします。
     
    ">>" で始まる行は、その時何をすべきかを指示しています。例えば、
    ........
    #+end_example

**** info
    f1 i
    #+begin_example
    --------------------Info 画面の例--------------------------------------
    File: dir,	Node: Top	This is the top of the INFO tree
     
    The Info Directory
    ******************
     
      The Info Directory is the top-level menu of major Info topics.
      Type "d" in Info to return to the Info Directory.  Type "q" to exit Info.
      Type "?" for a list of Info commands, or "h" to visit an Info tutorial.
      Type "m" to choose a menu item--for instance,
        "mEmacs<Return>" visits the Emacs manual.
      In Emacs Info, you can click mouse button 2 on a menu item
      or cross reference to follow it to its target.
      Each menu line that starts with a * is a topic you can select with "m".
      You can also select a topic by typing its ordinal number.
      Every third topic has a red * to help pick the right number to type.
     
    * Menu:
     
    Texinfo documentation system
    * Info: (info).                 How to use the documentation browsing system.
     
    Emacs
    * Emacs: (emacs).               The extensible self-documenting text editor.
    * Emacs FAQ: (efaq).            Frequently Asked Questions about Emacs.
    * Elisp: (elisp).               The Emacs Lisp Reference Manual.
    * Emacs Lisp Intro: (eintr).    A simple introduction to Emacs Lisp programming.
    * CC Mode: (ccmode).            Emacs mode for editing C, C++, Objective-C,
                                      Java, Pike, AWK, and CORBA IDL code.
    .............
    #+end_example

