emacs-help.html


<div id="outline-container-orgd366bca" class="outline-2">
<h2 id="orgd366bca"><span class="section-number-2">16.</span> help</h2>
<div class="outline-text-2" id="text-16">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">標準</th>
<th scope="col" class="org-left">代替キー</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">ヘルプメニューで選択</td>
</tr>

<tr>
<td class="org-left">f1 a</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">command-apropos : 似たコマンド名表示</td>
</tr>

<tr>
<td class="org-left">f1 b</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">describe-bindings : キーバインド一覧</td>
</tr>

<tr>
<td class="org-left">f1 f</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">describe-function : 関数説明</td>
</tr>

<tr>
<td class="org-left">f1 k&lt;key&gt;</td>
<td class="org-left">f9&lt;key&gt;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">describe-key : キーの割り当て関数表示</td>
</tr>

<tr>
<td class="org-left">f1 i</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">s-?</td>
<td class="org-left">info : info 表示</td>
</tr>

<tr>
<td class="org-left">f1 m</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">describe-mode : モード説明</td>
</tr>

<tr>
<td class="org-left">f1 v</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">describe-variable : 変数説明</td>
</tr>

<tr>
<td class="org-left">f1 w</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">where-is : 関数の割り当てキー表示</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org85d56e4" class="outline-3">
<h3 id="org85d56e4"><span class="section-number-3">16.1.</span> ヘルプ画面集</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-org3970f52" class="outline-4">
<h4 id="org3970f52"><span class="section-number-4">16.1.1.</span> メニュー</h4>
<div class="outline-text-4" id="text-16-1-1">
<p>
f1
</p>

<pre class="example" id="org70cea19">
You have typed , the help character.  Type a Help option:
(Use SPC or DEL to scroll through this text.  Type q to exit the Help command.)

a PATTERN   Show commands whose name matches the PATTERN (a list of words
              or a regexp).  See also the ‘apropos’ command.
b           Display all key bindings.
c KEYS      Display the command name run by the given key sequence.
C CODING    Describe the given coding system, or RET for current ones.
d PATTERN   Show a list of functions, variables, and other items whose
              documentation matches the PATTERN (a list of words or a regexp).
e           Go to the *Messages* buffer which logs echo-area messages.
f FUNCTION  Display documentation for the given function.
F COMMAND   Show the Emacs manual’s section that describes the command.
g           Display information about the GNU project.
h           Display the HELLO file which illustrates various scripts.
i           Start the Info documentation reader: read included manuals.
I METHOD    Describe a specific input method, or RET for current.
k KEYS      Display the full documentation for the key sequence.
K KEYS      Show the Emacs manual’s section for the command bound to KEYS.
l           Show last 300 input keystrokes (lossage).
L LANG-ENV  Describe a specific language environment, or RET for current.
m           Display documentation of current minor modes and current major mode,
              including their special commands.
n           Display news of recent Emacs changes.
o SYMBOL    Display the given function or variable’s documentation and value.
p TOPIC     Find packages matching a given topic keyword.
P PACKAGE   Describe the given Emacs Lisp package.
r           Display the Emacs manual in Info mode.
s           Display contents of current syntax table, plus explanations.
S SYMBOL    Show the section for the given symbol in the Info manual
              for the programming language used in this buffer.
t           Start the Emacs learn-by-doing tutorial.
v VARIABLE  Display the given variable’s documentation and value.
w COMMAND   Display which keystrokes invoke the given command (where-is).
.           Display any available local help at point in the echo area.

C-a         Information about Emacs.
C-c         Emacs copying permission (GNU General Public License).
C-d         Instructions for debugging GNU Emacs.
C-e         External packages and information about Emacs.
C-f         Emacs FAQ.
C-m         How to order printed Emacs manuals.
C-n         News of recent Emacs changes.
C-o         Emacs ordering and distribution information.
C-p         Info about known Emacs problems.
C-s         Search forward "help window".
C-t         Emacs TODO list.
C-w         Information on absence of warranty for GNU Emacs.
</pre>
</div>
</div>

<div id="outline-container-org49f75f7" class="outline-4">
<h4 id="org49f75f7"><span class="section-number-4">16.1.2.</span> tutorial</h4>
<div class="outline-text-4" id="text-16-1-2">
<p>
f1 t
</p>

<pre class="example" id="org6e1ac2c">
--------------------Tutorial  画面の例---------------------------------
Copyright (c) 1985 Free Software Foundation, Inc;  ファイル最後を参照のこと
       あなたが現在見ているのは Emacs 入門ガイドです。

Emacs のコマンドを入力するには、一般にコントロールキー（キートップに
CTRL とか CTL と書いてある）やメタキー（キートップに META とか ALT と
書いてある）を使います。そこで、CONTROL とか META とか書く代わりに、次
のような記号を使うことにします。

 C-&lt;文字&gt;   コントロールキーを押したまま、&lt;文字&gt;キーを押します。例えば、
     	C-f はコントロールキーを押しながら f のキーを押すことです。

 M-&lt;文字&gt;   メタキーを押したまま、&lt;文字&gt;キーを押します。もしメタキーがな
     	い場合は、エスケープキーを押してから離し、それから&lt;文字&gt;キー
     	を押します。以降エスケープキーのことを &lt;ESC&gt; と書きます。

！重要！: Emacsを終了するには、C-x C-c をタイプします。

"&gt;&gt;" で始まる行は、その時何をすべきかを指示しています。例えば、
........
</pre>
</div>
</div>

<div id="outline-container-orgc73fe6e" class="outline-4">
<h4 id="orgc73fe6e"><span class="section-number-4">16.1.3.</span> info</h4>
<div class="outline-text-4" id="text-16-1-3">
<p>
f1 i
</p>
<pre class="example" id="org4e948cf">
--------------------Info 画面の例--------------------------------------
File: dir,	Node: Top	This is the top of the INFO tree

The Info Directory
******************

  The Info Directory is the top-level menu of major Info topics.
  Type "d" in Info to return to the Info Directory.  Type "q" to exit Info.
  Type "?" for a list of Info commands, or "h" to visit an Info tutorial.
  Type "m" to choose a menu item--for instance,
    "mEmacs&lt;Return&gt;" visits the Emacs manual.
  In Emacs Info, you can click mouse button 2 on a menu item
  or cross reference to follow it to its target.
  Each menu line that starts with a * is a topic you can select with "m".
  You can also select a topic by typing its ordinal number.
  Every third topic has a red * to help pick the right number to type.

* Menu:

Texinfo documentation system
* Info: (info).                 How to use the documentation browsing system.

Emacs
* Emacs: (emacs).               The extensible self-documenting text editor.
* Emacs FAQ: (efaq).            Frequently Asked Questions about Emacs.
* Elisp: (elisp).               The Emacs Lisp Reference Manual.
* Emacs Lisp Intro: (eintr).    A simple introduction to Emacs Lisp programming.
* CC Mode: (ccmode).            Emacs mode for editing C, C++, Objective-C,
                                  Java, Pike, AWK, and CORBA IDL code.
.............
</pre>
</div>
</div>
