emacs-help.org
**** 初期画面
   f1 C-a

    #+begin_example
    Welcome to GNU Emacs, a part of the GNU operating system.
     
    Get help           C-h  (Hold down CTRL and press h)
    Emacs manual       C-h r        Browse manuals     C-h i
    Emacs tutorial     C-h t        Undo changes       C-x u
    Buy manuals        C-h RET      Exit Emacs         C-x C-c
    Activate menubar   M-`
    (‘C-’ means use the CTRL key.  ‘M-’ means use the Meta (or Alt) key.
    If you have no Meta key, you may instead type ESC followed by the character.)
    Useful tasks:
    Visit New File                  Open Home Directory
    Customize Startup               Open *scratch* buffer
     
    GNU Emacs 27.2 (build 1, x86_64-apple-darwin18.7.0, NS appkit-1671.60 Version 10.14.6 (Build 18G95))
     of 2021-03-28
    Copyright (C) 2021 Free Software Foundation, Inc.
     
    GNU Emacs comes with ABSOLUTELY NO WARRANTY; type C-h C-w for full details.
    Emacs is Free Software--Free as in Freedom--so you can redistribute copies
    of Emacs and modify it; type C-h C-c to see the conditions.
    Type C-h C-o for information on getting the latest version.
     
    If an Emacs session crashed recently, type M-x recover-session RET
    to recover the files you were editing.
    (C-h は f1 と読み替えてください)
    #+end_example
  

** コンソール起動する時の設定
*** iTerm2 設定 (Mac OSX)

    ~.emacs.d/doc/iTerm2/Iterm2-default.itermkeymap~ を
    
    iTerm2 > Preferences > Profiles > Keys > Presets > Import\\
    から読み込ませる。
    
    fn キーを押さなくても f1..f12が使えるようにする。
    
    macの ¥ キーは \ に変更し、fn + ¥ で ¥ にする。\\
    (Mac OSX では "¥" は2バイトUTF-8で "\" が本来の1バイト文字)
    
    C-up C-down などの Mission Controlキーとの競合問題を解決する。
    
    C-TAB C-S-TAB は iTerm2のタブ切り替えに使っても良い。

    M-C- はmagnet で使うのでemacsでは使わず、s-up などを M-C-up に読み替えて戻している。
    

*** teraterm 設定 (Windows)

    ~.emacs.d/TERA/KOSMAX.CNF~   (xterm用)\\
    をteraterm install directory に置き、KEYBOARD.CNF のかわりに使う。
       
    テラターム設定 メニュー
      - Setup
	- Terminal
	  - 端末ID  VT100              (この設定はダミー)
	  - Kanji(receive)   UTF-8
	  - Kanji(transmit)  UTF-8
	- Keyboard
           - Backspace Key    on       (Redhat では不要)
           - Delete Key       off
           - Send Meta Key    check    (Altで Meta-key)
        - Save Setup
       
    テラターム iniファイル
         TermType=xterm               (iniファイルでxtermにする)

*** 左Cntl キーの位置について

    Emacsのキー定義では、'A' キーの左が Cntl キーであると操作しやすい。\\
    Windows の Caps Lock キーと 左Cntl キーを入れ替えるとよい。


** 方針

Windows や Mac OSX のキー操作を取り入れてemacsの敷居を低くすることに努めた。\\
基本的な emacsのキーバインドは残している。Mac OSX ではemacs流のキーバインドが
取り入れられているため、違和感はないと思う。

本来のemacsキーバインドを変えたところは、次の通り。

- C-h はヘルプでなく、backspace
- C-r は逆方向検索でなく、置換
- C-z はサスペンドでなく、undo
- C-x は選択領域があるときだけ、切り取り
- C-c は選択領域があるときだけ、コピー
- C-v は画面スクロールでなくて貼り付け
- M-v は画面順方向スクロール。M-S-v が逆方向
- C-x, C-c, C-v, M-v は org-mode では標準どおり
  
おわり
# ブラウザでhtmlを見る
# C-c C-e h o
