emacs-help.html

<div id="outline-container-orgb28c5df" class="outline-4">
<h4 id="orgb28c5df"><span class="section-number-4">16.1.4.</span> 初期画面</h4>
<div class="outline-text-4" id="text-16-1-4">
<p>
f1 C-a
</p>

<pre class="example" id="orgd8b1f52">
Welcome to GNU Emacs, a part of the GNU operating system.

Get help           C-h  (Hold down CTRL and press h)
Emacs manual       C-h r        Browse manuals     C-h i
Emacs tutorial     C-h t        Undo changes       C-x u
Buy manuals        C-h RET      Exit Emacs         C-x C-c
Activate menubar   M-`
(‘C-’ means use the CTRL key.  ‘M-’ means use the Meta (or Alt) key.
If you have no Meta key, you may instead type ESC followed by the character.)
Useful tasks:
Visit New File                  Open Home Directory
Customize Startup               Open *scratch* buffer

GNU Emacs 27.2 (build 1, x86_64-apple-darwin18.7.0, NS appkit-1671.60 Version 10.14.6 (Build 18G95))
 of 2021-03-28
Copyright (C) 2021 Free Software Foundation, Inc.

GNU Emacs comes with ABSOLUTELY NO WARRANTY; type C-h C-w for full details.
Emacs is Free Software--Free as in Freedom--so you can redistribute copies
of Emacs and modify it; type C-h C-c to see the conditions.
Type C-h C-o for information on getting the latest version.

If an Emacs session crashed recently, type M-x recover-session RET
to recover the files you were editing.
(C-h は f1 と読み替えてください)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org8e70e0e" class="outline-2">
<h2 id="org8e70e0e"><span class="section-number-2">17.</span> コンソール起動する時の設定</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgcb00210" class="outline-3">
<h3 id="orgcb00210"><span class="section-number-3">17.1.</span> iTerm2 設定 (Mac OSX)</h3>
<div class="outline-text-3" id="text-17-1">
<p>
<code>.emacs.d/doc/iTerm2/Iterm2-default.itermkeymap</code> を
</p>

<p>
iTerm2 &gt; Preferences &gt; Profiles &gt; Keys &gt; Presets &gt; Import<br />
から読み込ませる。
</p>

<p>
fn キーを押さなくても f1..f12が使えるようにする。
</p>

<p>
macの ¥ キーは \ に変更し、fn + ¥ で ¥ にする。<br />
(Mac OSX では "¥" は2バイトUTF-8で "\" が本来の1バイト文字)
</p>

<p>
C-up C-down などの Mission Controlキーとの競合問題を解決する。
</p>

<p>
C-TAB C-S-TAB は iTerm2のタブ切り替えに使っても良い。
</p>

<p>
M-C- はmagnet で使うのでemacsでは使わず、s-up などを M-C-up に読み替えて戻している。
</p>
</div>
</div>


<div id="outline-container-org0a5f77a" class="outline-3">
<h3 id="org0a5f77a"><span class="section-number-3">17.2.</span> teraterm 設定 (Windows)</h3>
<div class="outline-text-3" id="text-17-2">
<p>
<code>.emacs.d/TERA/KOSMAX.CNF</code>   (xterm用)<br />
をteraterm install directory に置き、KEYBOARD.CNF のかわりに使う。
</p>

<p>
テラターム設定 メニュー
</p>
<ul class="org-ul">
<li>Setup
<ul class="org-ul">
<li>Terminal
<ul class="org-ul">
<li>端末ID  VT100              (この設定はダミー)</li>
<li>Kanji(receive)   UTF-8</li>
<li>Kanji(transmit)  UTF-8</li>
</ul></li>
<li>Keyboard
<ul class="org-ul">
<li>Backspace Key    on       (Redhat では不要)</li>
<li>Delete Key       off</li>
<li>Send Meta Key    check    (Altで Meta-key)</li>
</ul></li>
<li>Save Setup</li>
</ul></li>
</ul>

<p>
テラターム iniファイル
     TermType=xterm               (iniファイルでxtermにする)
</p>
</div>
</div>

<div id="outline-container-orgbfb298d" class="outline-3">
<h3 id="orgbfb298d"><span class="section-number-3">17.3.</span> 左Cntl キーの位置について</h3>
<div class="outline-text-3" id="text-17-3">
<p>
Emacsのキー定義では、'A' キーの左が Cntl キーであると操作しやすい。<br />
Windows の Caps Lock キーと 左Cntl キーを入れ替えるとよい。
</p>
</div>
</div>
</div>


<div id="outline-container-orga2fac34" class="outline-2">
<h2 id="orga2fac34"><span class="section-number-2">18.</span> 方針</h2>
<div class="outline-text-2" id="text-18">
<p>
Windows や Mac OSX のキー操作を取り入れてemacsの敷居を低くすることに努めた。<br />
基本的な emacsのキーバインドは残している。Mac OSX ではemacs流のキーバインドが
取り入れられているため、違和感はないと思う。
</p>

<p>
本来のemacsキーバインドを変えたところは、次の通り。
</p>

<ul class="org-ul">
<li>C-h はヘルプでなく、backspace</li>
<li>C-r は逆方向検索でなく、置換</li>
<li>C-z はサスペンドでなく、undo</li>
<li>C-x は選択領域があるときだけ、切り取り</li>
<li>C-c は選択領域があるときだけ、コピー</li>
<li>C-v は画面スクロールでなくて貼り付け</li>
<li>M-v は画面順方向スクロール。M-S-v が逆方向</li>
<li>C-x, C-c, C-v, M-v は org-mode では標準どおり</li>
</ul>

<p>
おわり
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Akira</p>
<p class="date">Created: 2026-02-21 Sat 14:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
